app/controllers/comments_controller.rb

  def create
	@post = Post.find(params[:post_id])
	@comment = @post.comments.create!(params[:comment])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
INSERT INTO `comments` (`created_at`, `body`, `updated_at`, `post_id`) VALUES('2011-07-10 04:58:16', '', '2011-07-10 04:58:16', NULL)