app/controllers/posts_controller.rb

INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`) VALUES('2011-07-09 16:33:17', 'Rails Rocks !!!', 'Ruby on Rails is an incredible framework for creating awesome web applications. ', '2011-07-09 16:33:17')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |any_var|
      if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `updated_at` = '2011-07-09 16:36:19', `body` = 'Ruby on Rails is an incredible framework for creating awesome web applications. This is a simple application using Scaffold.' WHERE `id` = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |any_var|
      if @post.update_attributes(params[:post])